Autodesk.Revit.DB.IFC.IFCOpeningDimensions.GetOpeningHandle
Gets the IFC opening element handle.
Returns:
The handle.
Since:
2027

Autodesk.Revit.DB.IFC.IFCOpeningDimensions.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.IFC.IFCOpeningDimensions.HasRectangularDimensions
True if width and height are valid, false if only area is valid.
Since:
2027

Autodesk.Revit.DB.IFC.IFCOpeningDimensions.Area
The area of the opening.
Since:
2027

Autodesk.Revit.DB.IFC.IFCOpeningDimensions.Height
The height of the opening.
Since:
2027

Autodesk.Revit.DB.IFC.IFCOpeningDimensions.Width
The width of the opening.
Since:
2027

Autodesk.Revit.DB.IFC.IFCOpeningDimensions.Depth
The depth of the opening.
Since:
2027

Autodesk.Revit.DB.IFC.IFCOpeningDimensions.#ctor(Autodesk.Revit.DB.IFC.IFCAnyHandle)
Creates opening dimensions with a specified handle.
The opening handle.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2027

Autodesk.Revit.DB.IFC.IFCOpeningDimensions.#ctor
Creates default opening dimensions with zero values.
Since:
2027

Autodesk.Revit.DB.IFC.IFCOpeningDimensions
Contains calculated dimensions for an IFC opening element.
Since:
2027